/* ======================================================
//
//   common - 共通設定
//
// ====================================================== */

// ステップシーケンサー・デフォルト設定
var DEFAULT_PADS =
// {
//     "rows":[
//          {"id":"0","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"triangle"}
//         ,{"id":"1","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"sine"}
//         ,{"id":"2","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"sawtooth"}
//         ,{"id":"3","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"square"}
//         ,{"id":"4","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"pwm"}
//         ,{"id":"5","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"pulse"}
//         ,{"id":"6","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"square4"}
//         ,{"id":"7","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"fmsquare"}
// ]};
{"rows":[{"id":"0","pads":[0,1,0,0,0,0,0,0,0,0,0,0,0,1,0,0],"name":"triangle"},{"id":"1","pads":[1,0,0,0,1,0,0,0,1,0,0,0,1,0,0,0],"name":"sine"},{"id":"2","pads":[0,0,0,0,0,0,0,1,0,0,0,0,0,0,0,0],"name":"sawtooth"},{"id":"3","pads":[0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,0],"name":"square"},{"id":"4","pads":[0,0,0,0,0,0,0,0,0,0,1,1,0,0,0,0],"name":"pwm"},{"id":"5","pads":[0,0,0,0,1,0,0,0,0,0,0,0,0,0,0,0],"name":"pulse"},{"id":"6","pads":[0,0,1,0,0,0,0,0,0,0,0,0,1,0,0,0],"name":"square4"},{"id":"7","pads":[0,0,0,0,0,0,1,0,0,0,0,0,0,0,0,0],"name":"fmsquare"}]};

var SYNTHS = {
    "synths":[
         {"id":"0","note":"C5","type":"triangle"}
        ,{"id":"1","note":"E5","type":"sine"}
        ,{"id":"2","note":"G5","type":"sawtooth"}
        ,{"id":"3","note":"C6","type":"square"}
        ,{"id":"4","note":"E6","type":"pwm"}
        ,{"id":"5","note":"G6","type":"pulse"}
        ,{"id":"6","note":"C7","type":"square4"}
        ,{"id":"7","note":"E7","type":"fmsquare"}
    ]};

var TEXTURE_NUM = 9;

/* ======================================================
// RequireJS の設定
// ------------------------------------------------------ */

require.config({
    //urlArgs: "=" + $.now(),
    baseUrl: './assets/js',
    shim: {
        '_': {
            exports: '_'
        }
    },
    paths: {
         'util'        : 'util'
        , 'matchMedia' : 'libs/matchMedia'
        , 'moment'     : 'libs/moment'
        , 'text'       : 'libs/text'
        , '_'          : 'libs/underscore'
        , 'Tone'       : 'libs/Tone.min'
    }
});
